Repository: kr3go6/LinuxApplicationDevelopment2024
Catalog: 12_InstallPackaging/*.po
Languages: ru

source: Gussing your number using binary search:
ru: Угадыватель вашего числа с помощью бин. поиска:

source: every time possible interval reduced in half
ru: каждый раз возможный интервал уменьшается вдвое,

source: depending on your answer.
ru: в зависимости от вашего ответа.

source: Usage: ./bin_search [-r] [-h]
ru: Использование: ./bin_search [-r] [-h]

source: -h: print this help
ru: -h: вывести на экран эту помощь

source: -r: roman mode
ru: -r: использовать римские числа

source: is your number greater than %s? [yes/no]
ru: ваше число больше, чем %s? [да/нет]

source: yes
ru: да

source: no
ru: нет

source: invalid input; please enter one word [yes] or [no].
ru: некорректный ввод; введите одно слово [да] или [нет].

source: your number is %s.
ru: ваше число %s.
